cli/artillery/parallel.yml
config:
  target: https://pie.dev
  http:
    timeout: 2
  phases:
    - duration: 3
      arrivalRate: 2
  defaults:
    headers:
  tls:
    rejectUnauthorized: false
  processor: "./printStatus.js"

scenarios:
  - flow:
      - parallel:                           # https://github.com/artilleryio/artillery-core/blob/master/test/scripts/parallel.json
        - count: 2
          loop:
          - get:
              url: "/status/200"
              sslAuth: false
        - get:
            url: "/status/400"
            sslAuth: false